PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_ctc.c
/*!
    \file    gd32f3x0_hal_ctc.c
    \brief   CTC driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"
#define CTC_FLAG_MASK            ((uint32_t)0x00000700U)

/*!
    \brief      reset CTC peripheral
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_ctc_deinit(hal_ctc_dev_struct *ctc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [*ctc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    ctc_dev->state = HAL_CTC_STATE_BUSY;
    /* reset CTC */
    hal_rcu_periph_reset_enable(RCU_CTCRST);
    hal_rcu_periph_reset_disable(RCU_CTCRST);

    /* change CTC error state and state */
    ctc_dev->error_state = HAL_CTC_ERROR_NONE;
    ctc_dev->state = HAL_CTC_STATE_RESET;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize CTC init structure
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] ctc_init: initialize the CTC parameter struct
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_ctc_init(hal_ctc_dev_struct *ctc_dev, hal_ctc_init_struct *ctc_init)
{
    uint16_t freq_value = 0U;
    uint8_t temp_cklim_value = 0U;
    uint16_t temp_reload_value = 0x00;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == ctc_dev) || (NULL == ctc_init)) {
        HAL_DEBUGE("pointer [ctc_dev] or pointer [ctc_init] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    ctc_dev->state = HAL_CTC_STATE_BUSY;
    if(ctc_init->source == CTC_REFSOURCE_LXTAL) {
        ctc_init->frequency = 32768;
    }
    if(ctc_init->cal_style == CTC_VALUE_AUTO_CAL) {
        switch(ctc_init->prescaler) {
        case CTC_REFSOURCE_PSC_OFF:
            freq_value = ctc_init->frequency;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV2:
            freq_value = (int)ctc_init->frequency / 2.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV4:
            freq_value = (int)ctc_init->frequency / 4.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV8:
            freq_value = (int)ctc_init->frequency / 8.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV16:
            freq_value = (int)ctc_init->frequency / 16.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV32:
            freq_value = (int)ctc_init->frequency / 32.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV64:
            freq_value = (int)ctc_init->frequency / 64.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        case CTC_REFSOURCE_PSC_DIV128:
            freq_value = (int)ctc_init->frequency / 128.0;
            temp_reload_value = CRS_CAL_RELOADVALUE(48000000, freq_value);
            temp_cklim_value = CRS_CAL_CKLIM(48000000, freq_value);
            break;
        default:
            HAL_DEBUGW("parameter [ctc_init->prescaler] value is undefine");
            break;
        }

        /* configure clock trim base limit value */
        hals_ctc_clock_limit_value_config(temp_cklim_value);
        /* configure CTC counter reload value */
        hals_ctc_counter_reload_value_config(temp_reload_value);
    } else {
        /* configure clock trim base limit value */
        hals_ctc_clock_limit_value_config(ctc_init->limit_value);
        /* configure CTC counter reload value */
        hals_ctc_counter_reload_value_config(ctc_init->reload_value);
    }

    /* select reference signal source */
    hals_ctc_refsource_signal_select(ctc_init->source);
    /* configure reference signal source polarity */
    hals_ctc_refsource_polarity_config(ctc_init->polarity);
    /* configure reference signal source prescaler */
    hals_ctc_refsource_prescaler_config(ctc_init->prescaler);
    /* configure hardware automatically trim mode */
    hals_ctc_hardware_trim_mode_config(CTC_HARDWARE_TRIM_MODE_ENABLE);

    /* change CTC error state and state */
    ctc_dev->error_state = HAL_CTC_ERROR_NONE;
    ctc_dev->state = HAL_CTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the CTC device structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_ctc_struct_type_enum>
    \param[in]  p_struct: pointer to CTC structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_ctc_struct_init(hal_ctc_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

