PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_ctc.c
    switch(hal_struct_type) {
    case HAL_CTC_INIT_STRUCT:
        /* initialize CTC initialization structure with the default values */
        ((hal_ctc_init_struct *)p_struct)->cal_style     = CTC_VALUE_AUTO_CAL;
        ((hal_ctc_init_struct *)p_struct)->source        = CTC_REFSOURCE_LXTAL;
        ((hal_ctc_init_struct *)p_struct)->polarity      = CTC_REFSOURCE_POLARITY_FALLING;
        ((hal_ctc_init_struct *)p_struct)->prescaler     = CTC_REFSOURCE_PSC_OFF;
        ((hal_ctc_init_struct *)p_struct)->limit_value   = 34;
        ((hal_ctc_init_struct *)p_struct)->reload_value  = 0;
        ((hal_ctc_init_struct *)p_struct)->frequency  = 1;
        break;
    case HAL_CTC_IRQ_STRUCT:
        /* initialize CTC IRQ structure with the default values */
        ((hal_ctc_irq_struct *)p_struct)->ctc_ckok_handle             = NULL;
        ((hal_ctc_irq_struct *)p_struct)->ctc_ckwarn_handle           = NULL;
        ((hal_ctc_irq_struct *)p_struct)->ctc_err_handle              = NULL;
        ((hal_ctc_irq_struct *)p_struct)->ctc_eref_handle             = NULL;
        break;
    case HAL_CTC_DEV_STRUCT:
        /* initialize CTC device structure with the default values */
        ((hal_ctc_dev_struct *)p_struct)->ctc_irq.ctc_ckok_handle    = NULL;
        ((hal_ctc_dev_struct *)p_struct)->ctc_irq.ctc_ckwarn_handle  = NULL;
        ((hal_ctc_dev_struct *)p_struct)->ctc_irq.ctc_err_handle     = NULL;
        ((hal_ctc_dev_struct *)p_struct)->ctc_irq.ctc_eref_handle    = NULL;
        ((hal_ctc_dev_struct *)p_struct)->error_state                = HAL_CTC_ERROR_NONE;
        ((hal_ctc_dev_struct *)p_struct)->state                      = HAL_CTC_STATE_NONE;
        ((hal_ctc_dev_struct *)p_struct)->mutex                      = HAL_MUTEX_UNLOCKED;
        ((hal_ctc_dev_struct *)p_struct)->priv                       = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      start CTC peripheral
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_ctc_start(hal_ctc_dev_struct *ctc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [ctc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    ctc_dev->state = HAL_CTC_STATE_BUSY;

    /* enable CTC trim counter */
    hals_ctc_counter_enable();

    ctc_dev->state = HAL_CTC_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop CTC peripheral
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_ctc_stop(hal_ctc_dev_struct *ctc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [ctc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    ctc_dev->state = HAL_CTC_STATE_BUSY;

    /* disable CTC trim counter */
    hals_ctc_counter_disable();

    ctc_dev->state = HAL_CTC_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the IRC48M trim value
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  trim_value: 6-bit IRC48M trim value
      \arg        0x00-0x3F
    \param[out] none
    \retval     none
*/
void hal_ctc_irc48m_trim_value_config(hal_ctc_dev_struct *ctc_dev, uint8_t trim_value)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [*ctc_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    hals_ctc_irc48m_trim_value_config(trim_value);
}

/*!
    \brief      CTC interrupt handler content function,which is merely used in ctc_handler
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_ctc_irq(hal_ctc_dev_struct *ctc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [ctc_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* check interrupt state bit */
    if(SET == hals_ctc_interrupt_flag_get(CTC_INT_FLAG_CKOK)) {
        /* clear interrupt flag */
        hals_ctc_interrupt_flag_clear(CTC_INT_FLAG_CKOK);
        /* ok callback */
        if(NULL != (ctc_dev->ctc_irq.ctc_ckok_handle)) {
            ctc_dev->ctc_irq.ctc_ckok_handle(ctc_dev);
        }
    }

    /* check interrupt state bit */
    if(SET == hals_ctc_interrupt_flag_get(CTC_INT_FLAG_CKWARN)) {
        /* clear interrupt flag */
        hals_ctc_interrupt_flag_clear(CTC_INT_FLAG_CKWARN);
        /* warning callback */
        if(NULL != (ctc_dev->ctc_irq.ctc_ckwarn_handle)) {
            ctc_dev->ctc_irq.ctc_ckwarn_handle(ctc_dev);
        }
    }

    /* check interrupt state bit */
    if(SET == hals_ctc_interrupt_flag_get(CTC_INT_FLAG_ERR)) {
        /* clear interrupt flag */
        hals_ctc_interrupt_flag_clear(CTC_INT_FLAG_ERR);
        /* error callback */
        if(NULL != (ctc_dev->ctc_irq.ctc_err_handle)) {
            ctc_dev->ctc_irq.ctc_err_handle(ctc_dev);
        }
    }

    /* check interrupt state bit */
    if(SET == hals_ctc_interrupt_flag_get(CTC_INT_FLAG_EREF)) {
        /* clear interrupt flag */
        hals_ctc_interrupt_flag_clear(CTC_INT_FLAG_EREF);
        /* expect reference callback */
        if(NULL != (ctc_dev->ctc_irq.ctc_eref_handle)) {
            ctc_dev->ctc_irq.ctc_eref_handle(ctc_dev);
        }
    }
}

/*!
    \brief      CTC interrupt handler content function,which is merely used in ctc_handler
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to CTC interrupt callback functions structure
    \param[out] none
    \retval     none
*/
void hal_ctc_irq_handle_set(hal_ctc_dev_struct *ctc_dev, hal_ctc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == ctc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [ctc_dev] or pointer [p_irq] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* clock trim OK interrupt handler set */
    if(NULL != p_irq->ctc_ckok_handle) {
        ctc_dev->ctc_irq.ctc_ckok_handle = p_irq->ctc_ckok_handle;
    } else {
        ctc_dev->ctc_irq.ctc_ckok_handle = NULL;
    }

    /* clock trim warning interrupt handler set */
    if(NULL != p_irq->ctc_ckwarn_handle) {
        ctc_dev->ctc_irq.ctc_ckwarn_handle = p_irq->ctc_ckwarn_handle;
    } else {
        ctc_dev->ctc_irq.ctc_ckwarn_handle = NULL;
    }

    /* error interrupt handler set */
    if(NULL != p_irq->ctc_err_handle) {
        ctc_dev->ctc_irq.ctc_err_handle = p_irq->ctc_err_handle;
    } else {
        ctc_dev->ctc_irq.ctc_err_handle = NULL;
    }

    /* expect reference interrupt handler set */
    if(NULL != p_irq->ctc_eref_handle) {
        ctc_dev->ctc_irq.ctc_eref_handle = p_irq->ctc_eref_handle;
    } else {
        ctc_dev->ctc_irq.ctc_eref_handle = NULL;
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  ctc_dev: CTC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_ctc_irq_handle_all_reset(hal_ctc_dev_struct *ctc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [ctc_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* configure interrupt callback function to NULL */
    ctc_dev->ctc_irq.ctc_ckok_handle   = NULL;
    ctc_dev->ctc_irq.ctc_ckwarn_handle = NULL;
    ctc_dev->ctc_irq.ctc_err_handle    = NULL;
    ctc_dev->ctc_irq.ctc_eref_handle   = NULL;
}

/*!
    \brief      start CTC device with interrupt
    \param[in]  ctc_dev: CTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the callback handler of CTC interrupt
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_ctc_start_interrupt(hal_ctc_dev_struct *ctc_dev, hal_ctc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == ctc_dev) {
        HAL_DEBUGE("pointer [ctc_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock CTC */
    HAL_LOCK(ctc_dev);

